ERM/src/Enums/SalesOrderStatus.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>SalesOrderStatus</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>DisputeNoSignedContract</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DisputeNoServiceSigned</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DisputePendingClientApprovalToInvoice</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DisputeExceedContractValue</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DisputeLostInHole</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DisputePricing</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DisputeTechnicalSQ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DisputeCustomerIsInsolventOrBankrupt</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DisputeSLBInternalDelaysSOIsMissing</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DisputeSLBInternalDelaysERPTimeCosureIsDifferent</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DisputeSLBInternalDelaysKSWasReceivedAfterERPClosing</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DisputeSLBInternalDelaysARDelay</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>StatusUnknown</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>InvoiceNotYetDueForBilling</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OngoingJob</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ERM/src/Enums/SalesOrderStatus/ManagerModule.bsl
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	Список = Новый СписокЗначений;
	Список.Добавить(Перечисления.SalesOrderStatus.DisputeNoSignedContract);
	Список.Добавить(Перечисления.SalesOrderStatus.DisputeNoServiceSigned);
	Список.Добавить(Перечисления.SalesOrderStatus.DisputePendingClientApprovalToInvoice);
	Список.Добавить(Перечисления.SalesOrderStatus.DisputeExceedContractValue);
	Список.Добавить(Перечисления.SalesOrderStatus.DisputeLostInHole);
	Список.Добавить(Перечисления.SalesOrderStatus.DisputePricing);
	Список.Добавить(Перечисления.SalesOrderStatus.DisputeTechnicalSQ);
	Список.Добавить(Перечисления.SalesOrderStatus.DisputeCustomerIsInsolventOrBankrupt);
	Список.Добавить(Перечисления.SalesOrderStatus.DisputeSLBInternalDelaysSOIsMissing);
	Список.Добавить(Перечисления.SalesOrderStatus.DisputeSLBInternalDelaysERPTimeCosureIsDifferent);
	Список.Добавить(Перечисления.SalesOrderStatus.DisputeSLBInternalDelaysARDelay);
	Список.Добавить(Перечисления.SalesOrderStatus.DisputeChemistryExtraConsumptionMI);
	Список.Добавить(Перечисления.SalesOrderStatus.OngoingJob);
	Список.Добавить(Перечисления.SalesOrderStatus.JECutOffDateDeferral);
	Список.Добавить(Перечисления.SalesOrderStatus.JETechnicalErrorsInERP);
	Список.Добавить(Перечисления.SalesOrderStatus.JEEliminationForNonLawsonSegments);
	
	ДанныеВыбора = Список;

КонецПроцедуры
